{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-EMAIL",
    "2": "B-ID_NUM",
    "3": "B-NAME_STUDENT",
    "4": "B-PHONE_NUM",
    "5": "B-STREET_ADDRESS",
    "6": "B-URL_PERSONAL",
    "7": "B-USERNAME",
    "8": "I-ID_NUM",
    "9": "I-NAME_STUDENT",
    "10": "I-STREET_ADDRESS"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-EMAIL": 1,
    "B-ID_NUM": 2,
    "B-NAME_STUDENT": 3,
    "B-PHONE_NUM": 4,
    "B-STREET_ADDRESS": 5,
    "B-URL_PERSONAL": 6,
    "B-USERNAME": 7,
    "I-ID_NUM": 8,
    "I-NAME_STUDENT": 9,
    "I-STREET_ADDRESS": 10,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.1",
  "vocab_size": 30522
}
