{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-NAME_STUDENT",
    "2": "I-NAME_STUDENT",
    "3": "B-EMAIL",
    "4": "I-EMAIL",
    "5": "B-PHONE_NUM",
    "6": "I-PHONE_NUM",
    "7": "B-USERNAME",
    "8": "I-USERNAME",
    "9": "B-URL_PERSONAL",
    "10": "I-URL_PERSONAL",
    "11": "B-ID_NUM",
    "12": "I-ID_NUM",
    "13": "B-STREET_ADDRESS",
    "14": "I-STREET_ADDRESS",
    "15": "B-DATE",
    "16": "I-DATE"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-DATE": 15,
    "B-EMAIL": 3,
    "B-ID_NUM": 11,
    "B-NAME_STUDENT": 1,
    "B-PHONE_NUM": 5,
    "B-STREET_ADDRESS": 13,
    "B-URL_PERSONAL": 9,
    "B-USERNAME": 7,
    "I-DATE": 16,
    "I-EMAIL": 4,
    "I-ID_NUM": 12,
    "I-NAME_STUDENT": 2,
    "I-PHONE_NUM": 6,
    "I-STREET_ADDRESS": 14,
    "I-URL_PERSONAL": 10,
    "I-USERNAME": 8,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.3",
  "vocab_size": 30522
}
